Reports/НарядНаСделку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Report>
		<Properties>
			<Name>НарядНаСделку</Name>
			<Comment>vvv</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормативЗарплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОтветственныеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/ТарифныеСтавкиРаботниковОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>ТарифныеСтавкиРаботниковОрганизации</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ставка</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентПоКонтракту</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифнаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифнаяСПовышениемПоИнструкции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаЗавершения</Name>
					<Comment>(Общ) vvv</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентПоКонтрактуЗавершения</Name>
					<Comment>vvv</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифнаяСтавкаЗавершения</Name>
					<Comment>vvv</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифнаяСПовышениемПоИнструкцииЗавершения</Name>
					<Comment>vvv</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодЗавершения</Name>
					<Comment>vvv</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьФизЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/РабочееВремяРаботниковОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<AccumulationRegister>
		<Properties>
			<Name>РабочееВремяРаботниковОрганизаций</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Часов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейПоНорме</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧасовПоНорме</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СводнаяЗапись</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВЦеломЗаПериод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидИспользованияРабочегоВремени</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторИспользованияРабочегоВремени</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьФизлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/СведенияОВидахРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>СведенияОВидахРабот</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтоимостьПоПрейскуранту</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КолЧеловек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаработнаяПлатаОсновная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаработнаяПлатаДополнительная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормативЗарплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасчетСдельныхРасценок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВидРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРабот</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РегламентированныйПроизводственныйКалендарь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>РегламентированныйПроизводственныйКалендарь</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пятидневка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Шестидневка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КалендарныеДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДня</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДнейПроизводственногоКалендаря</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДатаКалендаря</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВариантыПриемаДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ВариантыПриемаДенежныхСредств</Name>
			<Comment>vvv</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоследующаяОплатаПоСчету</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Карточка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредоплатаЧерезБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезвозмезднаяУслуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АкционнаяУслуга</Name>
					<Comment>vvv</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/НарядНаСделку/Ext/ObjectModule.bsl
#Если Клиент Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


Процедура СформироватьОтчет(ДокументРезультат, ЕстьОшибки = Ложь) Экспорт
    ДокументРезультат.Очистить();
	
	//Параметры документа
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ДокументРезультат.ПолеСлева			 = 10;
	ДокументРезультат.ПолеСправа		 = 0;
	ДокументРезультат.Защита             = Ложь;
	ДокументРезультат.ТолькоПросмотр     = Истина;
    ДокументРезультат.АвтоМасштаб		 = Истина;
	
	РеглВалюта = Константы.ВалютаРегламентированногоУчета.Получить();
    СведенияОбОрганизации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Организация,КонПериода);
	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("НачалоПериода",НачалоДня(НачПериода));
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Сотрудник",Сотрудник);
	Запрос.УстановитьПараметр("НормативЗарплаты",НормативЗарплаты);
	Запрос.УстановитьПараметр("КонецПериода",КонецДня(КонПериода));
	
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(ТарифныеСтавкиРаботниковОрганизации.Период) КАК Период,
	|	ТарифныеСтавкиРаботниковОрганизации.Сотрудник КАК Сотрудник,
	|	ВЫБОР
	|		КОГДА ТарифныеСтавкиРаботниковОрганизации.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
	|			ТОГДА ТарифныеСтавкиРаботниковОрганизации.Регистратор.Организация
	|		КОГДА ТарифныеСтавкиРаботниковОрганизации.Регистратор ССЫЛКА Документ.КадровоеПеремещениеОрганизаций
	|				И ТарифныеСтавкиРаботниковОрганизации.Регистратор.ОбособленноеПодразделениеКуда = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ТарифныеСтавкиРаботниковОрганизации.Регистратор.Организация
	|		ИНАЧЕ ТарифныеСтавкиРаботниковОрганизации.Регистратор.ОбособленноеПодразделениеКуда
	|	КОНЕЦ КАК Организация
	|ПОМЕСТИТЬ ВТДатыПоследнихИзмененийОкладов
	|ИЗ
	|	РегистрСведений.ТарифныеСтавкиРаботниковОрганизации КАК ТарифныеСтавкиРаботниковОрганизации
	|ГДЕ
	//|	ТарифныеСтавкиРаботниковОрганизации.Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)
	|	ТарифныеСтавкиРаботниковОрганизации.Период <= &КонецПериода
	|	И ТарифныеСтавкиРаботниковОрганизации.Сотрудник = &Сотрудник
	|
	|СГРУППИРОВАТЬ ПО
	|	ТарифныеСтавкиРаботниковОрганизации.Сотрудник,
	|	ВЫБОР
	|		КОГДА ТарифныеСтавкиРаботниковОрганизации.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
	|			ТОГДА ТарифныеСтавкиРаботниковОрганизации.Регистратор.Организация
	|		КОГДА ТарифныеСтавкиРаботниковОрганизации.Регистратор ССЫЛКА Документ.КадровоеПеремещениеОрганизаций
	|				И ТарифныеСтавкиРаботниковОрганизации.Регистратор.ОбособленноеПодразделениеКуда = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ТарифныеСтавкиРаботниковОрганизации.Регистратор.Организация
	|		ИНАЧЕ ТарифныеСтавкиРаботниковОрганизации.Регистратор.ОбособленноеПодразделениеКуда
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(РаботникиОрганизаций.Период) КАК Период,
	|	РаботникиОрганизаций.Сотрудник.Физлицо КАК ФизЛицо,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизаций.ПериодЗавершения <= &КонецПериода
	|				И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА РаботникиОрганизаций.ОбособленноеПодразделениеЗавершения
	|		ИНАЧЕ РаботникиОрганизаций.ОбособленноеПодразделение
	|	КОНЕЦ КАК Организация
	|ПОМЕСТИТЬ ВТДатыПоследнихДвижений
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|ГДЕ
	//|	РаботникиОрганизаций.Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)
	|	РаботникиОрганизаций.Период <= &КонецПериода
	|	И РаботникиОрганизаций.Сотрудник = &Сотрудник
	|
	|СГРУППИРОВАТЬ ПО
	|	РаботникиОрганизаций.Сотрудник.Физлицо,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизаций.ПериодЗавершения <= &КонецПериода
	|				И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА РаботникиОрганизаций.ОбособленноеПодразделениеЗавершения
	|		ИНАЧЕ РаботникиОрганизаций.ОбособленноеПодразделение
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДатыПоследнихДвижений.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ДатыПоследнихДвижений.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ДатыПоследнихДвижений.Организация
	|		ИНАЧЕ ДатыПоследнихДвижений.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК ГоловнаяОрганизация,
	|	РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
	|	РаботникиОрганизацийСрезПоследних.ТабельныйНомер КАК ТабельныйНомер,
	|	РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо КАК ФизЛицо,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <= &КонецПериода
	|				И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизацииЗавершения
	|		ИНАЧЕ РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации
	|	КОНЕЦ КАК Подразделение,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <= &КонецПериода
	|				И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА РаботникиОрганизацийСрезПоследних.ДолжностьЗавершения
	|		ИНАЧЕ РаботникиОрганизацийСрезПоследних.Должность
	|	КОНЕЦ КАК Должность,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <= &КонецПериода
	|				И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА РаботникиОрганизацийСрезПоследних.РазрядЕТСЗавершения
	|		ИНАЧЕ РаботникиОрганизацийСрезПоследних.РазрядЕТС
	|	КОНЕЦ КАК Разряд
	|ПОМЕСТИТЬ ВТДанныеСотрудника
	|ИЗ
	|	ВТДатыПоследнихДвижений КАК ДатыПоследнихДвижений
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизацийСрезПоследних
	|		ПО ДатыПоследнихДвижений.Период = РаботникиОрганизацийСрезПоследних.Период
	|			И ДатыПоследнихДвижений.ФизЛицо = РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДатыПоследнихИзмененийОкладов.Сотрудник КАК Сотрудник,
	|	ДатыПоследнихИзмененийОкладов.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ТарифныеСтавкиРаботниковОрганизации.ПериодЗавершения <= &КонецПериода
	|				И ТарифныеСтавкиРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ТарифныеСтавкиРаботниковОрганизации.СтавкаЗавершения
	|		ИНАЧЕ ТарифныеСтавкиРаботниковОрганизации.Ставка
	|	КОНЕЦ КАК Ставка
	|ПОМЕСТИТЬ ВТОклады
	|ИЗ
	|	ВТДатыПоследнихИзмененийОкладов КАК ДатыПоследнихИзмененийОкладов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифныеСтавкиРаботниковОрганизации КАК ТарифныеСтавкиРаботниковОрганизации
	|		ПО ДатыПоследнихИзмененийОкладов.Сотрудник = ТарифныеСтавкиРаботниковОрганизации.Сотрудник
	|			И ДатыПоследнихИзмененийОкладов.Период = ТарифныеСтавкиРаботниковОрганизации.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РабочееВремяРаботниковОрганизаций.Сотрудник КАК Сотрудник,
	|	СУММА(РабочееВремяРаботниковОрганизаций.Часов) КАК Часов
	|ПОМЕСТИТЬ ВТРабочееВремяРаботниковОрганизаций
	|ИЗ
	|	РегистрНакопления.РабочееВремяРаботниковОрганизаций КАК РабочееВремяРаботниковОрганизаций
	|ГДЕ
	|	РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Работа)
	|	И РабочееВремяРаботниковОрганизаций.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И РабочееВремяРаботниковОрганизаций.Сотрудник = &Сотрудник
	|
	|СГРУППИРОВАТЬ ПО
	|	РабочееВремяРаботниковОрганизаций.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВыполнениеЗаданияРаботникиОрганизации.Сотрудник КАК Сотрудник,
	|	СУММА(ВЫБОР
	|			КОГДА (ВыполнениеЗаданияРаботникиОрганизации.ВариантПриемаДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВариантыПриемаДенежныхСредств.БезвозмезднаяУслуга)) И (ЕСТЬNULL(СведенияОВидахРаботСрезПоследних.СтоимостьПоПрейскуранту, 0) <> 0)
	//|				ТОГДА 0
	//по мнению гончаровой должна быть зарплата, добавим проверку на ненулевую стоимость по прейскуранту
	|				ТОГДА ВЫРАЗИТЬ(ВыполнениеЗаданияРаботникиОрганизации.Сумма * ВЫБОР КОГДА ЕСТЬNULL(СведенияОВидахРаботСрезПоследних.НормативЗарплаты, 0) = 0 ТОГДА &НормативЗарплаты ИНАЧЕ ЕСТЬNULL(СведенияОВидахРаботСрезПоследних.НормативЗарплаты, 0) КОНЕЦ КАК ЧИСЛО(16, 2))
	|			КОГДА ЕСТЬNULL(СведенияОВидахРаботСрезПоследних.СтоимостьПоПрейскуранту, 0) = 0
	|				ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(СведенияОВидахРаботСрезПоследних.ЗаработнаяПлатаОсновная,0) * ВыполнениеЗаданияРаботникиОрганизации.Количество КАК ЧИСЛО(16, 2))
	//|			ИНАЧЕ ВЫРАЗИТЬ(ВыполнениеЗаданияРаботникиОрганизации.Сумма * &НормативЗарплаты КАК ЧИСЛО(16, 2))
	|			ИНАЧЕ ВЫРАЗИТЬ(ВыполнениеЗаданияРаботникиОрганизации.Сумма * ВЫБОР КОГДА ЕСТЬNULL(СведенияОВидахРаботСрезПоследних.НормативЗарплаты, 0) = 0 ТОГДА &НормативЗарплаты ИНАЧЕ ЕСТЬNULL(СведенияОВидахРаботСрезПоследних.НормативЗарплаты, 0) КОНЕЦ КАК ЧИСЛО(16, 2))
	|		КОНЕЦ) КАК СуммаПоНаряду,
	|	СУММА(ВЫБОР
	|			КОГДА (ВыполнениеЗаданияРаботникиОрганизации.ВариантПриемаДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВариантыПриемаДенежныхСредств.БезвозмезднаяУслуга)) И (ЕСТЬNULL(СведенияОВидахРаботСрезПоследних.СтоимостьПоПрейскуранту, 0) <> 0)
	//|				ТОГДА 0
	|				ТОГДА ВыполнениеЗаданияРаботникиОрганизации.Сумма
	|			КОГДА ЕСТЬNULL(СведенияОВидахРаботСрезПоследних.СтоимостьПоПрейскуранту, 0) = 0
	|				ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(СведенияОВидахРаботСрезПоследних.ЗаработнаяПлатаОсновная,0) * ВыполнениеЗаданияРаботникиОрганизации.Количество КАК ЧИСЛО(16, 2)) //исправил округление до 2 знаков, Гончарова 02.05.19
	|			ИНАЧЕ ВыполнениеЗаданияРаботникиОрганизации.Сумма
	|		КОНЕЦ) КАК ОбъемРабот,
	|	ВЫБОР
	|		КОГДА (ВыполнениеЗаданияРаботникиОрганизации.ВариантПриемаДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВариантыПриемаДенежныхСредств.БезвозмезднаяУслуга)) И (ЕСТЬNULL(СведенияОВидахРаботСрезПоследних.СтоимостьПоПрейскуранту, 0) <> 0)
	//|			ТОГДА &НормативЗарплаты
	|			ТОГДА ВЫБОР КОГДА ЕСТЬNULL(СведенияОВидахРаботСрезПоследних.НормативЗарплаты, 0) = 0 ТОГДА &НормативЗарплаты ИНАЧЕ ЕСТЬNULL(СведенияОВидахРаботСрезПоследних.НормативЗарплаты, 0) КОНЕЦ
	|		КОГДА ЕСТЬNULL(СведенияОВидахРаботСрезПоследних.СтоимостьПоПрейскуранту, 0) = 0
	|			ТОГДА 0
	//|		ИНАЧЕ &НормативЗарплаты
	|		ИНАЧЕ ВЫБОР КОГДА ЕСТЬNULL(СведенияОВидахРаботСрезПоследних.НормативЗарплаты, 0) = 0 ТОГДА &НормативЗарплаты ИНАЧЕ ЕСТЬNULL(СведенияОВидахРаботСрезПоследних.НормативЗарплаты, 0) КОНЕЦ
	|	КОНЕЦ КАК НормативЗарплаты,
	|	ВЫБОР
	|		КОГДА (ВыполнениеЗаданияРаботникиОрганизации.ВариантПриемаДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВариантыПриемаДенежныхСредств.БезвозмезднаяУслуга)) И (ЕСТЬNULL(СведенияОВидахРаботСрезПоследних.СтоимостьПоПрейскуранту, 0) <> 0)
	|			ТОГДА ""Работы, выполненные на безвозмездной основе (при наличии цены по прейскуранту)""
	|		КОГДА ЕСТЬNULL(СведенияОВидахРаботСрезПоследних.СтоимостьПоПрейскуранту, 0) = 0
	|			ТОГДА ""Работы, выполненные на безвозмездной основе (при наличии сдельной расценки)""
	|		ИНАЧЕ ""Работы, выполненные на платной основе""
	|	КОНЕЦ КАК ВыполненныеРаботы,
	|	ВыполнениеЗаданияРаботникиОрганизации.Ссылка.Организация КАК Организация,
	|	СУММА(ВЫРАЗИТЬ(ВыполнениеЗаданияРаботникиОрганизации.ПродолжительностьРаботы КАК ЧИСЛО(16, 3))) КАК Трудоемкость,
	|	ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.Ставка КАК Ставка,
	|	ДанныеСотрудника.Подразделение КАК Подразделение,
	|	ДанныеСотрудника.Должность КАК Должность,
	|	ДанныеСотрудника.Разряд КАК Разряд,
	|	РабочееВремяРаботниковОрганизаций.Часов
	|ИЗ
	|	Документ.ВыполнениеЗадания.РаботникиОрганизации КАК ВыполнениеЗаданияРаботникиОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОВидахРабот.СрезПоследних(&КонецПериода, ) КАК СведенияОВидахРаботСрезПоследних
	|		ПО ВыполнениеЗаданияРаботникиОрганизации.ВидРаботы = СведенияОВидахРаботСрезПоследних.ВидРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРабочееВремяРаботниковОрганизаций КАК РабочееВремяРаботниковОрганизаций
	|		ПО ВыполнениеЗаданияРаботникиОрганизации.Сотрудник = РабочееВремяРаботниковОрганизаций.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеСотрудника КАК ДанныеСотрудника
	|		ПО ВыполнениеЗаданияРаботникиОрганизации.Сотрудник = ДанныеСотрудника.Сотрудник
	|			И ВыполнениеЗаданияРаботникиОрганизации.Ссылка.Организация = ДанныеСотрудника.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОклады КАК ТарифныеСтавкиРаботниковОрганизацииСрезПоследних
	|		ПО ВыполнениеЗаданияРаботникиОрганизации.Сотрудник = ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.Сотрудник
	|			И ВыполнениеЗаданияРаботникиОрганизации.Ссылка.Организация = ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.Организация
	|ГДЕ
	|	ВыполнениеЗаданияРаботникиОрганизации.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ВыполнениеЗаданияРаботникиОрганизации.Сотрудник = &Сотрудник
	|	И ВыполнениеЗаданияРаботникиОрганизации.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыполнениеЗаданияРаботникиОрганизации.Сотрудник,
	|	ВыполнениеЗаданияРаботникиОрганизации.Ссылка.Организация,
	|	ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.Ставка,
	|	ДанныеСотрудника.Подразделение,
	|	ДанныеСотрудника.Должность,
	|	ДанныеСотрудника.Разряд,
	|	РабочееВремяРаботниковОрганизаций.Часов,
	|	ВЫБОР
	|		КОГДА (ВыполнениеЗаданияРаботникиОрганизации.ВариантПриемаДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВариантыПриемаДенежныхСредств.БезвозмезднаяУслуга)) И (ЕСТЬNULL(СведенияОВидахРаботСрезПоследних.СтоимостьПоПрейскуранту, 0) <> 0)
	//|			ТОГДА &НормативЗарплаты
	|			ТОГДА ВЫБОР КОГДА ЕСТЬNULL(СведенияОВидахРаботСрезПоследних.НормативЗарплаты, 0) = 0 ТОГДА &НормативЗарплаты ИНАЧЕ ЕСТЬNULL(СведенияОВидахРаботСрезПоследних.НормативЗарплаты, 0) КОНЕЦ
	|		КОГДА ЕСТЬNULL(СведенияОВидахРаботСрезПоследних.СтоимостьПоПрейскуранту, 0) = 0
	|			ТОГДА 0
	//|		ИНАЧЕ &НормативЗарплаты
	|		ИНАЧЕ ВЫБОР КОГДА ЕСТЬNULL(СведенияОВидахРаботСрезПоследних.НормативЗарплаты, 0) = 0 ТОГДА &НормативЗарплаты ИНАЧЕ ЕСТЬNULL(СведенияОВидахРаботСрезПоследних.НормативЗарплаты, 0) КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА (ВыполнениеЗаданияРаботникиОрганизации.ВариантПриемаДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВариантыПриемаДенежныхСредств.БезвозмезднаяУслуга)) И (ЕСТЬNULL(СведенияОВидахРаботСрезПоследних.СтоимостьПоПрейскуранту, 0) <> 0)
	|			ТОГДА ""Работы, выполненные на безвозмездной основе (при наличии цены по прейскуранту)""
	|		КОГДА ЕСТЬNULL(СведенияОВидахРаботСрезПоследних.СтоимостьПоПрейскуранту, 0) = 0
	|			ТОГДА ""Работы, выполненные на безвозмездной основе (при наличии сдельной расценки)""
	|		ИНАЧЕ ""Работы, выполненные на платной основе""
	|	КОНЕЦ";
	

	ЗапросПоОтветственным=Новый Запрос;
	
	ЗапросПоОтветственным.УстановитьПараметр("СписокОтветственных",ОтветственныеЛица.ВыгрузитьКолонку("Сотрудник"));
	ЗапросПоОтветственным.УстановитьПараметр("НачалоПериода",НачалоДня(НачПериода));
	ЗапросПоОтветственным.УстановитьПараметр("Организация",Организация);
	ЗапросПоОтветственным.УстановитьПараметр("Сотрудник",Сотрудник);
	ЗапросПоОтветственным.УстановитьПараметр("КонецПериода",КонецДня(КонПериода));
	
	ЗапросПоОтветственным.Текст=
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(ТарифныеСтавкиРаботниковОрганизации.Период) КАК Период,
	|	ТарифныеСтавкиРаботниковОрганизации.Сотрудник КАК Сотрудник,
	|	ВЫБОР
	|		КОГДА ТарифныеСтавкиРаботниковОрганизации.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
	|			ТОГДА ТарифныеСтавкиРаботниковОрганизации.Регистратор.Организация
	|		КОГДА ТарифныеСтавкиРаботниковОрганизации.Регистратор ССЫЛКА Документ.КадровоеПеремещениеОрганизаций
	|				И ТарифныеСтавкиРаботниковОрганизации.Регистратор.ОбособленноеПодразделениеКуда = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ТарифныеСтавкиРаботниковОрганизации.Регистратор.Организация
	|		ИНАЧЕ ТарифныеСтавкиРаботниковОрганизации.Регистратор.ОбособленноеПодразделениеКуда
	|	КОНЕЦ КАК Организация
	|ПОМЕСТИТЬ ВТДатыПоследнихИзмененийОкладов
	|ИЗ
	|	РегистрСведений.ТарифныеСтавкиРаботниковОрганизации КАК ТарифныеСтавкиРаботниковОрганизации
	|ГДЕ
	//|	ТарифныеСтавкиРаботниковОрганизации.Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)
	|	ТарифныеСтавкиРаботниковОрганизации.Период <= &КонецПериода
	|	И ТарифныеСтавкиРаботниковОрганизации.Сотрудник В (&СписокОтветственных)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТарифныеСтавкиРаботниковОрганизации.Сотрудник,
	|	ВЫБОР
	|		КОГДА ТарифныеСтавкиРаботниковОрганизации.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
	|			ТОГДА ТарифныеСтавкиРаботниковОрганизации.Регистратор.Организация
	|		КОГДА ТарифныеСтавкиРаботниковОрганизации.Регистратор ССЫЛКА Документ.КадровоеПеремещениеОрганизаций
	|				И ТарифныеСтавкиРаботниковОрганизации.Регистратор.ОбособленноеПодразделениеКуда = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ТарифныеСтавкиРаботниковОрганизации.Регистратор.Организация
	|		ИНАЧЕ ТарифныеСтавкиРаботниковОрганизации.Регистратор.ОбособленноеПодразделениеКуда
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(РаботникиОрганизаций.Период) КАК Период,
	|	РаботникиОрганизаций.Сотрудник.Физлицо КАК ФизЛицо,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизаций.ПериодЗавершения <= &КонецПериода
	|				И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА РаботникиОрганизаций.ОбособленноеПодразделениеЗавершения
	|		ИНАЧЕ РаботникиОрганизаций.ОбособленноеПодразделение
	|	КОНЕЦ КАК Организация
	|ПОМЕСТИТЬ ВТДатыПоследнихДвижений
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|ГДЕ
	//|	РаботникиОрганизаций.Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)
	|	РаботникиОрганизаций.Период <= &КонецПериода
	|	И ВЫБОР
	|		КОГДА РаботникиОрганизаций.ПериодЗавершения <= &КонецПериода
	|				И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА РаботникиОрганизаций.ОбособленноеПодразделениеЗавершения
	|		ИНАЧЕ РаботникиОрганизаций.ОбособленноеПодразделение
	|	КОНЕЦ = &Организация
	|	И РаботникиОрганизаций.Сотрудник  В (&СписокОтветственных)
	|
	|СГРУППИРОВАТЬ ПО
	|	РаботникиОрганизаций.Сотрудник.Физлицо,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизаций.ПериодЗавершения <= &КонецПериода
	|				И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА РаботникиОрганизаций.ОбособленноеПодразделениеЗавершения
	|		ИНАЧЕ РаботникиОрганизаций.ОбособленноеПодразделение
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДатыПоследнихДвижений.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ДатыПоследнихДвижений.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ДатыПоследнихДвижений.Организация
	|		ИНАЧЕ ДатыПоследнихДвижений.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК ГоловнаяОрганизация,
	|	РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
	|	РаботникиОрганизацийСрезПоследних.ТабельныйНомер КАК ТабельныйНомер,
	|	РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо КАК ФизЛицо,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <= &КонецПериода
	|				И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизацииЗавершения
	|		ИНАЧЕ РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации
	|	КОНЕЦ КАК Подразделение,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <= &КонецПериода
	|				И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА РаботникиОрганизацийСрезПоследних.ДолжностьЗавершения
	|		ИНАЧЕ РаботникиОрганизацийСрезПоследних.Должность
	|	КОНЕЦ КАК Должность,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <= &КонецПериода
	|				И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА РаботникиОрганизацийСрезПоследних.РазрядЕТСЗавершения
	|		ИНАЧЕ РаботникиОрганизацийСрезПоследних.РазрядЕТС
	|	КОНЕЦ КАК Разряд
	|ИЗ
	|	ВТДатыПоследнихДвижений КАК ДатыПоследнихДвижений
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизацийСрезПоследних
	|		ПО ДатыПоследнихДвижений.Период = РаботникиОрганизацийСрезПоследних.Период
	|			И ДатыПоследнихДвижений.ФизЛицо = РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо
	|";
	
	РезультатОтветственные=ЗапросПоОтветственным.Выполнить();
	
	Результат = Запрос.Выполнить();
	
	ДокументРезультат.Очистить();
	Макет = ПолучитьМакет("НарядНаСделку");
	
	ОбластьШапка=Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока=Макет.ПолучитьОбласть("Строка");
	ОбластьИтого=Макет.ПолучитьОбласть("Подвал");
	ОбластьРуки=Макет.ПолучитьОбласть("Руки");
	
	ВыборкаПоСотруднику=Результат.Выбрать();
	
	ВывелиШапку=Ложь;
	
	Нпп=1;		
	ИтогоОбъемРабот = 0;
	ИтогоСуммаПоНаряду = 0;
	ИтогоТрудоемкость = 0;
	
	Расшифровка = Новый  Структура;
	Расшифровка.Вставить("РезультатОтветственные",РезультатОтветственные);
	
	Пока ВыборкаПоСотруднику.Следующий() Цикл
		
		Если не ВывелиШапку ТОгда
			
			ОбластьШапка.Параметры.Заполнить(ВыборкаПоСотруднику);
			//ОбластьШапка.Параметры.ПериодОтчета=ФОРМАТ(КонПериода,"ДФ='ММММ гггг ""г.""'");
			ОбластьШапка.Параметры.ПериодОтчета=ПредставлениеПериода(НачПериода,КонецДня(КонПериода));
			ДокументРезультат.Вывести(ОбластьШапка);
			ВывелиШапку=Истина;
			
		КонецЕсли;		
		
		Если ВыборкаПоСотруднику.НормативЗарплаты<>0 ТОгда 
			СуммаПоНаряду=Окр(ВыборкаПоСотруднику.ОбъемРабот*ВыборкаПоСотруднику.НормативЗарплаты,2);
		Иначе
			СуммаПоНаряду=ВыборкаПоСотруднику.СуммаПоНаряду;
		КонецЕсли;		
		ОбластьСтрока.Параметры.Заполнить(ВыборкаПоСотруднику);
		ОбластьСтрока.Параметры.СуммаПоНаряду=СуммаПоНаряду;
		ОбластьСтрока.Параметры.Нпп=Нпп;
		
		Расшифровка.Вставить("Сотрудник",ВыборкаПоСотруднику.Сотрудник);
		Расшифровка.Вставить("НачПериода",НачалоДня(НачПериода));
		Расшифровка.Вставить("КонПериода", КонецДня(КонПериода));
		ОбластьСтрока.Параметры.Расшифровка=Расшифровка;	
		
		ДокументРезультат.Вывести(ОбластьСтрока);
		ИтогоОбъемРабот = ИтогоОбъемРабот + ВыборкаПоСотруднику.ОбъемРабот;
		//ИтогоСуммаПоНаряду = ИтогоСуммаПоНаряду + ВыборкаПоСотруднику.СуммаПоНаряду;
		ИтогоСуммаПоНаряду = ИтогоСуммаПоНаряду + СуммаПоНаряду;
		ИтогоТрудоемкость = ИтогоТрудоемкость + ВыборкаПоСотруднику.Трудоемкость;
		Нпп=Нпп+1;			          
		
	КонецЦикла;
	
	ОбластьИтого.Параметры.ОбъемРабот=ИтогоОбъемРабот;
	ОбластьИтого.Параметры.СуммаПоНаряду=ИтогоСуммаПоНаряду;
	ОбластьИтого.Параметры.Трудоемкость=ИтогоТрудоемкость;
	
	ДокументРезультат.Вывести(ОбластьИтого);	
	
	ВыборкаПоОтветственным=РезультатОтветственные.Выбрать();
	
	Пока ВыборкаПоОтветственным.Следующий() Цикл
		
		ОбластьРуки.Параметры.Должность=ВыборкаПоОтветственным.Должность;
		ОбластьРуки.Параметры.Ответственный=ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(ВыборкаПоОтветственным.ФизЛицо);
		
		ДокументРезультат.Вывести(ОбластьРуки);
		
	КонецЦикла;	

	
КонецПроцедуры

Процедура РасшифроватьОтчет(Расшифровка) Экспорт
	
	
	Запрос=Новый Запрос;
	
	Запрос.УстановитьПараметр("Сотрудник",Расшифровка.Сотрудник);
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("НачалоПериода",Расшифровка.НачПериода);
	Запрос.УстановитьПараметр("КонецПериода",Расшифровка.КонПериода);
	
	Запрос.Текст=
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(РаботникиОрганизаций.Период) КАК Период,
	|	РаботникиОрганизаций.Сотрудник КАК Сотрудник,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизаций.ПериодЗавершения <= &КонецПериода
	|				И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА РаботникиОрганизаций.ОбособленноеПодразделениеЗавершения
	|		ИНАЧЕ РаботникиОрганизаций.ОбособленноеПодразделение
	|	КОНЕЦ КАК Организация
	|ПОМЕСТИТЬ ВТДатыПоследнихДвижений
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|ГДЕ
	//|	РаботникиОрганизаций.Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)
	|	РаботникиОрганизаций.Период <= &КонецПериода
	|	И ВЫБОР
	|		КОГДА РаботникиОрганизаций.ПериодЗавершения <= &КонецПериода
	|				И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА РаботникиОрганизаций.ОбособленноеПодразделениеЗавершения
	|		ИНАЧЕ РаботникиОрганизаций.ОбособленноеПодразделение
	|	КОНЕЦ = &Организация
	|	И РаботникиОрганизаций.Сотрудник = &Сотрудник
	|
	|СГРУППИРОВАТЬ ПО
	|	РаботникиОрганизаций.Сотрудник,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизаций.ПериодЗавершения <= &КонецПериода
	|				И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА РаботникиОрганизаций.ОбособленноеПодразделениеЗавершения
	|		ИНАЧЕ РаботникиОрганизаций.ОбособленноеПодразделение
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДатыПоследнихДвижений.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ДатыПоследнихДвижений.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ДатыПоследнихДвижений.Организация
	|		ИНАЧЕ ДатыПоследнихДвижений.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК ГоловнаяОрганизация,
	|	РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
	|	РаботникиОрганизацийСрезПоследних.ТабельныйНомер КАК ТабельныйНомер,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <= &КонецПериода
	|				И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизацииЗавершения
	|		ИНАЧЕ РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации
	|	КОНЕЦ КАК Подразделение,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <= &КонецПериода
	|				И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА РаботникиОрганизацийСрезПоследних.ДолжностьЗавершения
	|		ИНАЧЕ РаботникиОрганизацийСрезПоследних.Должность
	|	КОНЕЦ КАК Должность,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <= &КонецПериода
	|				И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА РаботникиОрганизацийСрезПоследних.РазрядЕТСЗавершения
	|		ИНАЧЕ РаботникиОрганизацийСрезПоследних.РазрядЕТС
	|	КОНЕЦ КАК Разряд
	|ПОМЕСТИТЬ ВТДанныеСотрудника
	|ИЗ
	|	ВТДатыПоследнихДвижений КАК ДатыПоследнихДвижений
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизацийСрезПоследних
	|		ПО ДатыПоследнихДвижений.Период = РаботникиОрганизацийСрезПоследних.Период
	|			И ДатыПоследнихДвижений.Сотрудник = РаботникиОрганизацийСрезПоследних.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВыполнениеЗаданияРаботникиОрганизации.Ссылка.ДатаЗадания КАК ДатаЗадания,
	|	ВыполнениеЗаданияРаботникиОрганизации.Сотрудник КАК Сотрудник,
	|	СУММА(ВЫБОР
	|			КОГДА ВыполнениеЗаданияРаботникиОрганизации.ВариантПриемаДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВариантыПриемаДенежныхСредств.БезвозмезднаяУслуга)
	//|				ТОГДА 0
	|				ТОГДА ВыполнениеЗаданияРаботникиОрганизации.Сумма
	|			КОГДА ЕСТЬNULL(СведенияОВидахРаботСрезПоследних.СтоимостьПоПрейскуранту, 0) = 0
	|				ТОГДА ВЫРАЗИТЬ(СведенияОВидахРаботСрезПоследних.ЗаработнаяПлатаОсновная * ВыполнениеЗаданияРаботникиОрганизации.Количество КАК ЧИСЛО(16, 2))
	|			ИНАЧЕ ВыполнениеЗаданияРаботникиОрганизации.Сумма
	|		КОНЕЦ) КАК ОбъемРабот,
	|	СУММА(ВЫРАЗИТЬ(ВыполнениеЗаданияРаботникиОрганизации.ПродолжительностьРаботы КАК ЧИСЛО(16, 3))) КАК Трудоемкость
	|ПОМЕСТИТЬ ВТПлатныеРаботы
	|ИЗ
	|	Документ.ВыполнениеЗадания.РаботникиОрганизации КАК ВыполнениеЗаданияРаботникиОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОВидахРабот.СрезПоследних(&КонецПериода, ) КАК СведенияОВидахРаботСрезПоследних
	|		ПО ВыполнениеЗаданияРаботникиОрганизации.ВидРаботы = СведенияОВидахРаботСрезПоследних.ВидРаботы
	|ГДЕ
	|	ВыполнениеЗаданияРаботникиОрганизации.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ВыполнениеЗаданияРаботникиОрганизации.ВариантПриемаДенежныхСредств <> ЗНАЧЕНИЕ(Перечисление.ВариантыПриемаДенежныхСредств.БезвозмезднаяУслуга)
	|	И ЕСТЬNULL(СведенияОВидахРаботСрезПоследних.СтоимостьПоПрейскуранту, 0) <> 0
	|	И ВыполнениеЗаданияРаботникиОрганизации.Сотрудник = &Сотрудник
	|	И ВыполнениеЗаданияРаботникиОрганизации.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыполнениеЗаданияРаботникиОрганизации.Ссылка.ДатаЗадания,
	|	ВыполнениеЗаданияРаботникиОрганизации.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВыполнениеЗаданияРаботникиОрганизации.Ссылка.ДатаЗадания КАК ДатаЗадания,
	|	ВыполнениеЗаданияРаботникиОрганизации.Сотрудник КАК Сотрудник,
	|	СУММА(ВЫБОР
	|			КОГДА ВыполнениеЗаданияРаботникиОрганизации.ВариантПриемаДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВариантыПриемаДенежныхСредств.БезвозмезднаяУслуга)
	|				И ЕСТЬNULL(СведенияОВидахРаботСрезПоследних.СтоимостьПоПрейскуранту, 0) <> 0
	//|				ТОГДА 0
	|				ТОГДА ВыполнениеЗаданияРаботникиОрганизации.Сумма
	|			КОГДА ЕСТЬNULL(СведенияОВидахРаботСрезПоследних.СтоимостьПоПрейскуранту, 0) = 0
	|				ТОГДА ВЫРАЗИТЬ(СведенияОВидахРаботСрезПоследних.ЗаработнаяПлатаОсновная * ВыполнениеЗаданияРаботникиОрганизации.Количество КАК ЧИСЛО(16, 2))
	|			ИНАЧЕ ВыполнениеЗаданияРаботникиОрганизации.Сумма
	|		КОНЕЦ) КАК ОбъемРабот,
	|	СУММА(ВЫРАЗИТЬ(ВыполнениеЗаданияРаботникиОрганизации.ПродолжительностьРаботы КАК ЧИСЛО(16, 3))) КАК Трудоемкость
	|ПОМЕСТИТЬ ВТБезвозмездныеЦена
	|ИЗ
	|	Документ.ВыполнениеЗадания.РаботникиОрганизации КАК ВыполнениеЗаданияРаботникиОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОВидахРабот.СрезПоследних(&КонецПериода, ) КАК СведенияОВидахРаботСрезПоследних
	|		ПО ВыполнениеЗаданияРаботникиОрганизации.ВидРаботы = СведенияОВидахРаботСрезПоследних.ВидРаботы
	|ГДЕ
	|	ВыполнениеЗаданияРаботникиОрганизации.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ВыполнениеЗаданияРаботникиОрганизации.ВариантПриемаДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВариантыПриемаДенежныхСредств.БезвозмезднаяУслуга)
	|	И ЕСТЬNULL(СведенияОВидахРаботСрезПоследних.СтоимостьПоПрейскуранту, 0) <> 0
	|	И ВыполнениеЗаданияРаботникиОрганизации.Сотрудник = &Сотрудник
	|	И ВыполнениеЗаданияРаботникиОрганизации.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыполнениеЗаданияРаботникиОрганизации.Ссылка.ДатаЗадания,
	|	ВыполнениеЗаданияРаботникиОрганизации.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВыполнениеЗаданияРаботникиОрганизации.Ссылка.ДатаЗадания КАК ДатаЗадания,
	|	ВыполнениеЗаданияРаботникиОрганизации.Сотрудник КАК Сотрудник,
	|	СУММА(ВЫБОР
	|			КОГДА ВыполнениеЗаданияРаботникиОрганизации.ВариантПриемаДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВариантыПриемаДенежныхСредств.БезвозмезднаяУслуга)
	|				И ЕСТЬNULL(СведенияОВидахРаботСрезПоследних.СтоимостьПоПрейскуранту, 0) <> 0
	//|				ТОГДА 0
	|				ТОГДА ВыполнениеЗаданияРаботникиОрганизации.Сумма
	|			КОГДА ЕСТЬNULL(СведенияОВидахРаботСрезПоследних.СтоимостьПоПрейскуранту, 0) = 0
	|				ТОГДА ВЫРАЗИТЬ(СведенияОВидахРаботСрезПоследних.ЗаработнаяПлатаОсновная * ВыполнениеЗаданияРаботникиОрганизации.Количество КАК ЧИСЛО(16, 2))
	|			ИНАЧЕ ВыполнениеЗаданияРаботникиОрганизации.Сумма
	|		КОНЕЦ) КАК ОбъемРабот,
	|	СУММА(ВЫРАЗИТЬ(ВыполнениеЗаданияРаботникиОрганизации.ПродолжительностьРаботы КАК ЧИСЛО(16, 3))) КАК Трудоемкость
	|ПОМЕСТИТЬ ВТБезвозмездныеРасценка
	|ИЗ
	|	Документ.ВыполнениеЗадания.РаботникиОрганизации КАК ВыполнениеЗаданияРаботникиОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОВидахРабот.СрезПоследних(&КонецПериода, ) КАК СведенияОВидахРаботСрезПоследних
	|		ПО ВыполнениеЗаданияРаботникиОрганизации.ВидРаботы = СведенияОВидахРаботСрезПоследних.ВидРаботы
	|ГДЕ
	|	ВыполнениеЗаданияРаботникиОрганизации.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	//|	И ВыполнениеЗаданияРаботникиОрганизации.ВариантПриемаДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВариантыПриемаДенежныхСредств.БезвозмезднаяУслуга)
	|	И ЕСТЬNULL(СведенияОВидахРаботСрезПоследних.СтоимостьПоПрейскуранту, 0) = 0
	|	И ВыполнениеЗаданияРаботникиОрганизации.Сотрудник = &Сотрудник
	|	И ВыполнениеЗаданияРаботникиОрганизации.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыполнениеЗаданияРаботникиОрганизации.Ссылка.ДатаЗадания,
	|	ВыполнениеЗаданияРаботникиОрганизации.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря КАК ДатаМесяца
	|ПОМЕСТИТЬ ВТПериоды
	|ИЗ
	|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|ГДЕ
	|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &НачалоПериода И &КонецПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РабочееВремяРаботниковОрганизаций.Сотрудник КАК Сотрудник,
	|	РабочееВремяРаботниковОрганизаций.Период КАК ДатаМесяца,
	|	РабочееВремяРаботниковОрганизаций.Часов КАК Часов
	|ПОМЕСТИТЬ ВТРабочееВремяРаботниковОрганизаций
	|ИЗ
	|	РегистрНакопления.РабочееВремяРаботниковОрганизаций КАК РабочееВремяРаботниковОрганизаций
	|ГДЕ
	|	РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Работа)
	|	И РабочееВремяРаботниковОрганизаций.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И РабочееВремяРаботниковОрганизаций.Сотрудник = &Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Периоды.ДатаМесяца КАК Дата,
	|	ДанныеСотрудника.Должность КАК Должность,
	|	ЕСТЬNULL(РабочееВремяРаботниковОрганизаций.Часов,0) КАК Часов,
	|	ЕСТЬNULL(ПлатныеРаботы.ОбъемРабот,0) КАК ОбъемРаботПлатно,
	|	ЕСТЬNULL(ПлатныеРаботы.Трудоемкость,0) КАК ТрудоемкостьПлатно,
	|	ЕСТЬNULL(БезвозмездныеЦена.ОбъемРабот,0) КАК ОбъемРаботБезвозмездноЦена,
	|	ЕСТЬNULL(БезвозмездныеЦена.Трудоемкость,0) КАК ТрудоемкостьБезвозмездноЦена,
	|	ЕСТЬNULL(БезвозмездныеРасценка.ОбъемРабот,0) КАК ОбъемРаботБезвозмездноРасценка,
	|	ЕСТЬNULL(БезвозмездныеРасценка.Трудоемкость,0) КАК ТрудоемкостьБезвозмездноРасценка
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРабочееВремяРаботниковОрганизаций КАК РабочееВремяРаботниковОрганизаций
	|		ПО (РабочееВремяРаботниковОрганизаций.ДатаМесяца = Периоды.ДатаМесяца)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПлатныеРаботы КАК ПлатныеРаботы
	|		ПО (ПлатныеРаботы.ДатаЗадания = Периоды.ДатаМесяца)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБезвозмездныеЦена КАК БезвозмездныеЦена
	|		ПО (БезвозмездныеЦена.ДатаЗадания = Периоды.ДатаМесяца)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБезвозмездныеРасценка КАК БезвозмездныеРасценка
	|		ПО (БезвозмездныеРасценка.ДатаЗадания = Периоды.ДатаМесяца)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеСотрудника КАК ДанныеСотрудника
	|		ПО ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	Периоды.ДатаМесяца";
	
	
	Результат = Запрос.Выполнить();
	
	ТабДок=Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("ВедомостьУчетаВыполненныхРабот");
	
	ОбластьШапка=Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока=Макет.ПолучитьОбласть("Строка");
	ОбластьИтого=Макет.ПолучитьОбласть("Подвал");
	ОбластьРуки=Макет.ПолучитьОбласть("Руки");
	
	ВыборкаПоСотруднику=Результат.Выбрать();
	
	ВывелиШапку=Ложь;
	
	ИтогоОбъемРаботПлатно = 0;
	ИтогоТрудоемкостьПлатно = 0;
	ИтогоОбъемРаботБезвозмездноЦена = 0;
	ИтогоТрудоемкостьБезвозмездноЦена = 0;
	ИтогоОбъемРаботБезвозмездноРасценка = 0;
	ИтогоТрудоемкостьБезвозмездноРасценка = 0;
	
	Пока ВыборкаПоСотруднику.Следующий() Цикл
		
		Если не ВывелиШапку ТОгда                
			
			ОбластьШапка.Параметры.Заполнить(ВыборкаПоСотруднику);
			ОбластьШапка.Параметры.Сотрудник=Расшифровка.Сотрудник;			
			//ОбластьШапка.Параметры.ПериодОтчета=ФОРМАТ(Период,"ДФ='ММММ гггг ""г.""'");
			ОбластьШапка.Параметры.ПериодОтчета=ПредставлениеПериода(НачПериода,КонецДня(КонПериода));
			ТабДок.Вывести(ОбластьШапка);
			ВывелиШапку=Истина;
			
		КонецЕсли;		
					
		ОбластьСтрока.Параметры.Заполнить(ВыборкаПоСотруднику);		
		ТабДок.Вывести(ОбластьСтрока);
		ИтогоОбъемРаботПлатно = ИтогоОбъемРаботПлатно + ВыборкаПоСотруднику.ОбъемРаботПлатно;		
		ИтогоТрудоемкостьПлатно = ИтогоТрудоемкостьПлатно + ВыборкаПоСотруднику.ТрудоемкостьПлатно;
		ИтогоОбъемРаботБезвозмездноЦена = ИтогоОбъемРаботБезвозмездноЦена + ВыборкаПоСотруднику.ОбъемРаботБезвозмездноЦена;		
		ИтогоТрудоемкостьБезвозмездноЦена = ИтогоТрудоемкостьБезвозмездноЦена + ВыборкаПоСотруднику.ТрудоемкостьБезвозмездноЦена;
		ИтогоОбъемРаботБезвозмездноРасценка = ИтогоОбъемРаботБезвозмездноРасценка + ВыборкаПоСотруднику.ОбъемРаботБезвозмездноРасценка;		
		ИтогоТрудоемкостьБезвозмездноРасценка = ИтогоТрудоемкостьБезвозмездноРасценка + ВыборкаПоСотруднику.ТрудоемкостьБезвозмездноРасценка;
		
		
	КонецЦикла;
	
	ОбластьИтого.Параметры.ОбъемРаботПлатно=ИтогоОбъемРаботПлатно;	
	ОбластьИтого.Параметры.ТрудоемкостьПлатно=ИтогоТрудоемкостьПлатно;
	ОбластьИтого.Параметры.ОбъемРаботБезвозмездноЦена=ИтогоОбъемРаботБезвозмездноЦена;	
	ОбластьИтого.Параметры.ТрудоемкостьБезвозмездноЦена=ИтогоТрудоемкостьБезвозмездноЦена;
	ОбластьИтого.Параметры.ОбъемРаботБезвозмездноРасценка=ИтогоОбъемРаботБезвозмездноРасценка;	
	ОбластьИтого.Параметры.ТрудоемкостьБезвозмездноРасценка=ИтогоТрудоемкостьБезвозмездноРасценка;
	
	ТабДок.Вывести(ОбластьИтого);	
	
	ВыборкаПоОтветственным=Расшифровка.РезультатОтветственные.Выбрать();
	
	Пока ВыборкаПоОтветственным.Следующий() Цикл
		
		ОбластьРуки.Параметры.Должность=ВыборкаПоОтветственным.Должность;
		ОбластьРуки.Параметры.Ответственный=ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(ВыборкаПоОтветственным.ФизЛицо);
		
		ТабДок.Вывести(ОбластьРуки);
		
	КонецЦикла;
	
	//Параметры документа
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.Защита             = Ложь;
	ТабДок.ТолькоПросмотр     = Истина;
    ТабДок.АвтоМасштаб		 = Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ФиксацияСверху = 7;
	ТабДок.Показать("Ведомость учета выполненных работ");
		
КонецПроцедуры


#КонецЕсли
